Revit 2026 API

# ExternalServiceOptionsIsRecordable Property

---

Indicates whether executions of the service is recorded in documents or not.

**Namespace:** Autodesk.Revit.DB.ExternalService**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsRecordable { get; set; }
```
```vb
Public Property IsRecordable As Boolean
	Get
	Set
```
```cpp
public:
property bool IsRecordable {
	bool get ();
	void set (bool value);
}
```
```fsharp
member IsRecordable : bool with get, set
```

#### Property Value

Boolean

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: A service that doens't support activation should not be recordable. |

When a recordable service is executed in a document, a record about the executed server (or servers) is stored in the document's history. This allows active servers to be synchronized next time a saved document is opened in Revit.

Executions of a recordable service in a document must happen inside a transaction.

#### Reference

ExternalServiceOptions Class

Autodesk.Revit.DB.ExternalService Namespace